content-org/subtree-export-example.org
#+hugo_base_dir: ../
#+hugo_section: ./post

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t


* Emacs                                                              :@emacs:
#+TITLE: Subtree Test
#+EXPORT_FILE_NAME: writing-hugo-blog-in-org-subtree-export

All posts in here will have the category set to /emacs/.
** TODO Writing Hugo blog in Org                                   :hugo:org:
*** First heading within the post
- This post will be exported as
  =content/posts/writing-hugo-blog-in-org-subtree-export.md=.
- Its title will be "Writing Hugo blog in Org".
- It will have /hugo/ and /org/ tags and /emacs/ as category.
- The menu item /weight/ and post /weight/ are auto-calculated.
- The menu item /identifier/ is auto-set.
- The /lastmod/ property in the front-matter is set automatically to
  the time of export.
**** A sub-heading under that heading
- It's draft state will be marked as =true= as the subtree has the
  todo state set to /TODO/.

With the point _anywhere_ in this /Writing Hugo blog in Org/ post
subtree, do =C-c C-e H H= to export just this post.

The exported Markdown has a little comment footer as set in the /Local
Variables/ section below.
* Footnotes
* COMMENT Local Variables                                           :ARCHIVE:
# Local Variables:
# org-hugo-footer: "\n\n[//]: # \"Exported with love from a post written in Org mode\"\n[//]: # \"- https://github.com/kaushalmodi/ox-hugo\""
# End:
