content/post/subtree-export-example.md
+++
title = "Subtree Test"
lastmod = 2018-11-19T19:52:12+08:00
draft = false
+++

## Emacs {#emacs}

:EXPORT\_FILE\_NAME: writing-hugo-blog-in-org-subtree-export

All posts in here will have the category set to _emacs_.


### <span class="org-todo todo TODO">TODO</span> Writing Hugo blog in Org {#writing-hugo-blog-in-org}


#### First heading within the post {#first-heading-within-the-post}

-   This post will be exported as
    `content/posts/writing-hugo-blog-in-org-subtree-export.md`.
-   Its title will be "Writing Hugo blog in Org".
-   It will have _hugo_ and _org_ tags and _emacs_ as category.
-   The menu item _weight_ and post _weight_ are auto-calculated.
-   The menu item _identifier_ is auto-set.
-   The _lastmod_ property in the front-matter is set automatically to
    the time of export.

-    A sub-heading under that heading

    -   It's draft state will be marked as `true` as the subtree has the
        todo state set to _TODO_.

    With the point <span class="underline">anywhere</span> in this _Writing Hugo blog in Org_ post
    subtree, do `C-c C-e H H` to export just this post.

    The exported Markdown has a little comment footer as set in the _Local
    Variables_ section below.
